OpenFOAM-v1812/tutorials/multiphase/interFoam/laminar/sloshingTank3D3DoF/Allrun
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

m4 system/blockMeshDict.m4 > system/blockMeshDict
runApplication blockMesh

cp 0/alpha.water.orig 0/alpha.water
runApplication setFields
runApplication $(getApplication)

#------------------------------------------------------------------------------
